mas/index.org
#+TITLE:    Multiagent Systems Course
#+AUTHOR:   Jomi F. Hübner
#+EMAIL:    jomi.hubner@ufsc.br

#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  pt
#+OPTIONS: email:t H:2 toc:nil num:nil author:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://jomifred.github.io/ia/ia.css" />

* Course Organisation (PPGEAS/UFSC 2021-2)

  - [[./syllabus.pdf][Syllabus]]
  - [[./tp/tp-cnp.pdf][Practical Exercise 1]] 
  - [[./tp/tp-auction.pdf][Practical Exercise 2]] 
  - [[./tp/tp-gold-miners.pdf][Practical Exercise 3]] 
  - [[./seminario-sma.pdf][Seminars]]
  

| Date | Topic        |                                                                                                                                          |   |
|------+--------------+------------------------------------------------------------------------------------------------------------------------------------------+---|
| 9/11 | Introduction | [[./slides/intro.pdf][Slides]]                                                                                                           |   |
|      |              | Reading: [[https://mitpress.mit.edu/books/multi-agent-oriented-programming][Chapter 2]] of MAOP book                                     |   |
|      |              | Reading: [[./leituras/agentlink-roadmap.pdf][AgentLink Roadmap]]                                                                         |   |
| 16/11 | Agents       | Reading: [[./leituras/IntellAgents.Wool.pdf][Intelligent Agents (Wooldridge)]]                                                           |   |
|      |              | Reading: [[https://www.csc2.ncsu.edu/faculty/mpsingh/papers/columns/aow-1-5-97.pdf][Agent definition vs test (Huhns & Singh)]] (2 pages) |   |
| 23/11 | AOP          | Tutorial: [[http://jason.sourceforge.net/mini-tutorial/getting-started/][Jason Getting Started]]                                         |   |
|      |              | Reading: [[https://mitpress.mit.edu/books/multi-agent-oriented-programming][Chapters 3 and 4]] of MAOP book                              |   |
|      |              | Reading: [[https://doi.org/10.3390/computers10020016][Review AOP (Cardoso et al)]]                                                       |   |
|      |              | [[./slides/slides-aop.pdf][Slides]] /  [[http://jason.sf.net][Jason]]                                                                    |   |
| 30/11 | Interaction  | Reading: [[./leituras/SpeechActs-Searle.pdf][Speech Acts (Searle)]]                                                                      |   |
|      |              | Reading: [[https://mitpress.mit.edu/books/multi-agent-oriented-programming][Sections 7.1 and 7.2]] of MAOP book                          |   |
|      |              | Reading: [[./leituras/SpeechActs-AOP.pdf][Speech Acts in AOP (Renata Vieira et al)]]                                                     |   |
|      |              | Reading: [[./leituras/FIPA-JADE.pdf][Developing MAS FIPA-compliant (Bellifemine et al)]]                                                 |   |
|      |              | Reading: [[./leituras/WhitePaperJADEEXP.pdf][JADE white paper (Bellifemine et al)]]                                                      |   |
|      |              | [[./slides/slides-interaction.pdf][Slides]] / [[./interaction/exemplo-jade-maicon.zip][Example of programs]] (Maicon)                    |   |
|      |              | Tutorial: [[http://jason.sourceforge.net/mini-tutorial/jason-jade/][Jason + Jade]]                                                       |   |
| 7/12 | BDI          | Reading: [[./leituras/cohe90_1.pdf][Intention is Choice with Commitment (Cohen et al)]]                                                  |   |
|      |              | Reading: [[./leituras/Bratman-TwoFacesOfIntention.pdf][Two Faces of Intention (Bratman)]]                                                |   |
|      |              | Reading: [[./leituras/Bratman-PlansPracticalResoning.pdf][Plans and Resource-Bounded Practical Reasoning (Bratman et al)]]               |   |
|      |              | Reading: [[./leituras/mascardi05languages.pdf][Languages for BDI (Mascardi et al)]]                                                      |   |
|      |              | Tutorial: [[http://jason.sourceforge.net/mini-tutorial/hello-bdi/][Jason Hello BDI]]                                                     |   |
| 14/12 | Environment  | [[./slides/slides-eop.pdf][Slides]] / [[http://cartago.sourceforge.net/][CArtAgO]]                                                       |   |
|      |              | Reading: [[https://mitpress.mit.edu/books/multi-agent-oriented-programming][Chapters 5 and 6, and Section 7.3]] of MAOP book             |   |
|      |              | Reading: [[./leituras/Ricci-Artefacts.pdf][Environment programming (Ricci et al)]]                                                       |   |
|      |              | Deadline for [[./tp/tp-cnp.pdf][*Practical Exercise 1*]]                                                                                 |   |
| 1/2  | JaCaMo       | Reading: [[http://dx.doi.org/10.1016/j.scico.2011.10.004][Multi-agent oriented programming (Boissier et al)]]                            |   |
|      |              | Tutorial: [[http://jacamo.sourceforge.net/tutorial/hello-world/][JaCaMo Hello World]]                                                    |   |
|      |              | Tutorial: [[http://jacamo.sourceforge.net/tutorial/gold-miners][Gold Miners]]                                                            |   |
| 8/2  | Organisation | [[./slides/slides-oop.pdf][Slides]] / [[http://moise.sf.net][Moise]]                                                                     |   |
|      |              | Reading: [[https://mitpress.mit.edu/books/multi-agent-oriented-programming][Chapters 8 and 9]] of MAOP book                              |   |
|      |              | Reading: [[http://moise.sourceforge.net/doc/publications/Hubner-sbia2002.pdf][Moise Model (Hubner et al)]]                               |   |
|      |              | Reading: [[http://dx.doi.org/10.1007/s10458-009-9084-y][ORA4MAS]]                                                                        |   |
|      |              | Deadline for [[./tp/tp-auction.pdf][*Practical Exercise 2*]]                                                                             |   |
| 15/2 | Norms        | [[./slides/slides-norms.pdf][Slides]] / [[https://github.com/moise-lang/npl][NPL]]                                                       |   |
|      |              | Reading: [[./leituras/Boella-Introdo-NormMas.pdf][Introduction to NorMAS (Boella et al)]]                                                |   |
|      |              | Reading: [[http://drops.dagstuhl.de/opus/volltexte/2013/3998/][Norms in MAS (Balke et al)]]                                              |   |
|      |              | Reading: [[http://dx.doi.org/10.1155/2014/684587][Survey (Mahmoud et al)]]                                                               |   |
|      |              | Reading: [[http://dx.doi.org/10.1007/s10472-011-9251-0][Normative Programming Language used in JaCaMo]]                                  |   |
|      |              | Deadline for *seminar topics*                                                                                                            |   |
| 22/2 | Coordination | Reading: [[https://doi.org/10.1007/1-4020-8058-1_17][Coordination Infrastructures (Omicini et al)]]                                      |   |
|      |              | Reading: [[http://web.media.mit.edu/~cynthiab/Readings/cohen-teamwork.pdf][Teamwork (Choen et Levesque)]]                                |   |
|      |              | Tutorial: [[http://jacamo.sourceforge.net/tutorial/coordination/][Coordination with JaCaMo]]                                             |   |
| 8/3  | MAOP         | [[./slides/slides-maop.pdf][Slides]] / [[http://jacamo.sf.net][JaCaMo]]                                                                  |   |
|      |              | Tutorial: building a house (in JaCaMo distribution file)                                                                                 |   |
|      |              | Reading: [[./leituras/Jennings-AG-SE.pdf][On agent-based software engineering (Jennings)]]                                               |   |
| 15/3 |              | [[./2017/seminario-sma.pdf][*Seminars*]]                                                                                                 |   |
| 22/3 |              | (Seminars -- cont.)                                                                                                                      |   |
|      |              | Deadline for  [[./tp/tp-gold-miners.pdf][*Practical Exercise 3*]]                                                                        |   |
|      |              |                                                                                                                                          |   |

* COMMENT old
| 12/11 | Methods      | [[./slides/slides-openaeolus.pdf][Slides]] / [[http://www.uez.com.br/aeolus][Open AEOlus]]                                                  |   |
|      |              | Reading: [[./leituras/golden-fleece.pdf][Jason and the Golden Fleece (Bordini et al)]]                                                   |   |



* COMMENT Course Presentation (PPGEAS/UFSC 2014)

  - [[./2014/syllabus.pdf][Syllabus]]
  - [[./tp/tp-cnp.pdf][Practical Exercise 1]] 
  - [[./tp/tp-auction.pdf][Practical Exercise 2]] 
  - [[./2014/seminario-sma.pdf][Seminars]]
  - [[./2014/projeto-sma.pdf][Project]]
  

| Date  | Topic        |                                                                                                                            |   |
|-------+--------------+----------------------------------------------------------------------------------------------------------------------------+---|
| 13/08 | Introduction |                                                                                                                            |   |
| 20/08 | Agents       | Reading: [[./leituras/agentlink-roadmap.pdf][AgentLink Roadmap]]                                                           |   |
|       |              | Reading: [[./leituras/IntellAgents.Wool.pdf][Intelligent Agents (Wooldridge)]]                                             |   |
| 27/08 | BDI          | Reading: [[./leituras/cohe90_1.pdf][Intention is Choice with Commitment (Cohen et al)]]                                    |   |
|       |              | Reading: [[./leituras/Bratman-TwoFacesOfIntention.pdf][Two Faces of Intention (Bratman)]]                                  |   |
|       |              | Reading: [[./leituras/Bratman-PlansPracticalResoning.pdf][Plans and Resource-Bounded Practical Reasoning (Bratman et al)]] |   |
| 03/09 | Interaction  | Reading: [[./leituras/FIPA-JADE.pdf][Developing MAS FIPA-compliant (Bellifemine et al)]]                                   |   |
|       |              | Reading: [[./leituras/WhitePaperJADEEXP.pdf][JADE white paper (Bellifemine et al)]]                                        |   |
|       |              | [[./slides/slides-interaction.pdf][Slides]] / [[./interaction/exemplo-jade-maicon.zip][Example of programs]]               |   |
| 17/09 | AOP          | [[./slides/slides-aop.pdf][Slides]] /  [[http://jason.sf.net][Jason]]                                                      |   |
|       |              | Reading: [[./leituras/golden-fleece.pdf][Jason and the Golden Fleece (Bordini et al)]]                                     |   |
|       |              | Tutorial: [[http://jason.sourceforge.net/mini-tutorial/getting-started/][Getting Started]]                                 |   |
| 24/09 | AOP          | Reading: [[./leituras/mascardi05languages.pdf][Languages for BDI (Mascardi et al)]]                                        |   |
|       |              | Tutorial: [[http://jacamo.sourceforge.net/tutorial/gold-miners][Gold Miners]]                                              |   |
| 01/10 | Environment  | [[./slides/slides-eop.pdf][Slides]] / [[http://cartago.sourceforge.net/][CArtAgO]]                                         |   |
|       |              | Reading: [[./leituras/Ricci-Artefacts.pdf][Environment programming (Ricci et al)]]                                         |   |
| 15/10 | Organisation | [[./slides/slides-oop.pdf][Slides]] / [[http://moise.sf.net][Moise]]                                                       |   |
|       |              | Reading: [[http://moise.sourceforge.net/doc/publications/Hubner-sbia2002.pdf][Moise Model (Hubner et al)]]                 |   |
|       |              | Reading: [[http://dx.doi.org/10.1007/s10458-009-9084-y][ORA4MAS]]                                                          |   |
|       |              | Deadline for [[./tp/tp-cnp.pdf][*Practical Exercise 1*]]                                                                   |   |
| 22/10 | MAOP         | [[./slides/slides-maop.pdf][Slides]] / [[http://jacamo.sf.net][JaCaMo]]                                                    |   |
|       |              | Reading: [[http://dx.doi.org/10.1016/j.scico.2011.10.004][Multi-agent oriented programming (Boissier et al)]]              |   |
|       |              | Tutorial: building a house (in JaCaMo distribution file)                                                                   |   |
| 29/10 | Methods      | [[./slides/slides-aose.pdf][Slides]] / [[http://www.uez.com.br/aeolus/metodo.html][Prometheus AEOlus]]                     |   |
| 05/11 |              | Deadline for [[./tp/tp-auction.pdf][*Practical Exercise 2*]]                                                               |   |
| 12/11 |              |                                                                                                                            |   |
| 19/11 |              | [[./2014/seminario-sma.pdf][*Seminars*]]                                                                                   |   |
| 26/11 |              | (Seminars -- cont.)                                                                                                        |   |
| 03/12 |              | [[./2014/projeto-sma.pdf][*Final Project*]] presentation                                                                   |   |
|       |              |                                                                                                                            |   |





