mas/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt" xml:lang="pt">
<head>
<title>Multiagent Systems Course</title>
<!-- 2021-11-16 Tue 18:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jomi F. Hübner" />
<link rel="stylesheet" type="text/css" href="https://jomifred.github.io/ia/ia.css" />
</head>
<body>
<div id="content">
<h1 class="title">Multiagent Systems Course</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Course Organisation (PPGEAS/UFSC 2021-2)</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="./syllabus.pdf">Syllabus</a>
</li>
<li><a href="./tp/tp-cnp.pdf">Practical Exercise 1</a> 
</li>
<li><a href="./tp/tp-auction.pdf">Practical Exercise 2</a> 
</li>
<li><a href="./tp/tp-gold-miners.pdf">Practical Exercise 3</a> 
</li>
<li><a href="./seminario-sma.pdf">Seminars</a>
</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Date</th>
<th scope="col" class="left">Topic</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">9/11</td>
<td class="left">Introduction</td>
<td class="left"><a href="./slides/intro.pdf">Slides</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="https://mitpress.mit.edu/books/multi-agent-oriented-programming">Chapter 2</a> of MAOP book</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="./leituras/agentlink-roadmap.pdf">AgentLink Roadmap</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Agents</td>
<td class="left">Reading: <a href="./leituras/IntellAgents.Wool.pdf">Intelligent Agents (Wooldridge)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="https://www.csc2.ncsu.edu/faculty/mpsingh/papers/columns/aow-1-5-97.pdf">Agent definition vs test (Huhns &amp; Singh)</a> (2 pages)</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">16/11</td>
<td class="left">AOP</td>
<td class="left">Tutorial: <a href="http://jason.sourceforge.net/mini-tutorial/getting-started/">Jason Getting Started</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="https://mitpress.mit.edu/books/multi-agent-oriented-programming">Chapter 4</a> of MAOP book</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="https://doi.org/10.3390/computers10020016">Review AOP (Cardoso et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left"><a href="./slides/slides-aop.pdf">Slides</a> /  <a href="http://jason.sf.net">Jason</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">23/11</td>
<td class="left">Interaction</td>
<td class="left">Reading: <a href="./leituras/SpeechActs-Searle.pdf">Speech Acts (Searle)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="./leituras/SpeechActs-AOP.pdf">Speech Acts in AOP (Renata Vieira et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="https://mitpress.mit.edu/books/multi-agent-oriented-programming">Sections 7.1 and 7.2</a> of MAOP book</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="./leituras/FIPA-JADE.pdf">Developing MAS FIPA-compliant (Bellifemine et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="./leituras/WhitePaperJADEEXP.pdf">JADE white paper (Bellifemine et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left"><a href="./slides/slides-interaction.pdf">Slides</a> / <a href="./interaction/exemplo-jade-maicon.zip">Example of programs</a> (Maicon)</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Tutorial: <a href="http://jason.sourceforge.net/mini-tutorial/jason-jade/">Jason + Jade</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">30/11</td>
<td class="left">BDI</td>
<td class="left">Reading: <a href="./leituras/cohe90_1.pdf">Intention is Choice with Commitment (Cohen et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="./leituras/Bratman-TwoFacesOfIntention.pdf">Two Faces of Intention (Bratman)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="./leituras/Bratman-PlansPracticalResoning.pdf">Plans and Resource-Bounded Practical Reasoning (Bratman et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="./leituras/mascardi05languages.pdf">Languages for BDI (Mascardi et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Tutorial: <a href="http://jason.sourceforge.net/mini-tutorial/hello-bdi/">Jason Hello BDI</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">7/12</td>
<td class="left">Environment</td>
<td class="left"><a href="./slides/slides-eop.pdf">Slides</a> / <a href="http://cartago.sourceforge.net/">CArtAgO</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="https://mitpress.mit.edu/books/multi-agent-oriented-programming">Chapters 3, 5, 6, and Section 7.3</a> of MAOP book</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="./leituras/Ricci-Artefacts.pdf">Environment programming (Ricci et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Deadline for <a href="./tp/tp-cnp.pdf"><b>Practical Exercise 1</b></a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">14/12, 1/2</td>
<td class="left">JaCaMo</td>
<td class="left">Reading: <a href="http://dx.doi.org/10.1016/j.scico.2011.10.004">Multi-agent oriented programming (Boissier et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Tutorial: <a href="http://jacamo.sourceforge.net/tutorial/hello-world/">JaCaMo Hello World</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Tutorial: <a href="http://jacamo.sourceforge.net/tutorial/gold-miners">Gold Miners</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">8/2</td>
<td class="left">Organisation</td>
<td class="left"><a href="./slides/slides-oop.pdf">Slides</a> / <a href="http://moise.sf.net">Moise</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="https://mitpress.mit.edu/books/multi-agent-oriented-programming">Chapters 8 and 9</a> of MAOP book</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="http://moise.sourceforge.net/doc/publications/Hubner-sbia2002.pdf">Moise Model (Hubner et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="http://dx.doi.org/10.1007/s10458-009-9084-y">ORA4MAS</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Deadline for <a href="./tp/tp-auction.pdf"><b>Practical Exercise 2</b></a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">15/2</td>
<td class="left">Norms</td>
<td class="left"><a href="./slides/slides-norms.pdf">Slides</a> / <a href="https://github.com/moise-lang/npl">NPL</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="./leituras/Boella-Introdo-NormMas.pdf">Introduction to NorMAS (Boella et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="http://drops.dagstuhl.de/opus/volltexte/2013/3998/">Norms in MAS (Balke et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="http://dx.doi.org/10.1155/2014/684587">Survey (Mahmoud et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="http://dx.doi.org/10.1007/s10472-011-9251-0">Normative Programming Language used in JaCaMo</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Deadline for <b>seminar topics</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">22/2</td>
<td class="left">Coordination</td>
<td class="left">Reading: <a href="https://doi.org/10.1007/1-4020-8058-1_17">Coordination Infrastructures (Omicini et al)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="http://web.media.mit.edu/~cynthiab/Readings/cohen-teamwork.pdf">Teamwork (Choen et Levesque)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Tutorial: <a href="http://jacamo.sourceforge.net/tutorial/coordination/">Coordination with JaCaMo</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">8/3</td>
<td class="left">MAOP</td>
<td class="left"><a href="./slides/slides-maop.pdf">Slides</a> / <a href="http://jacamo.sf.net">JaCaMo</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Tutorial: building a house (in JaCaMo distribution file)</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Reading: <a href="./leituras/Jennings-AG-SE.pdf">On agent-based software engineering (Jennings)</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">15/3</td>
<td class="left">&#xa0;</td>
<td class="left"><a href="./2017/seminario-sma.pdf"><b>Seminars</b></a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">22/3</td>
<td class="left">&#xa0;</td>
<td class="left">(Seminars &#x2013; cont.)</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Deadline for  <a href="./tp/tp-gold-miners.pdf"><b>Practical Exercise 3</b></a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jomi F. Hübner</p>
<p class="email">Email: <a href="mailto:jomi.hubner@ufsc.br">jomi.hubner@ufsc.br</a></p>
<p class="date">Created: 2021-11-16 Tue 18:14</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>